AMR/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "/surfaceMeshes/geometry.fms";

//minCellSize 0.5;
maxCellSize 0.0005;

boundaryLayers
{
//    nLayers 3;

//    thicknessRatio 1.2;

//    maxFirstLayerThickness 0.5;

    patchBoundaryLayers
    {
        wall
        {
            nLayers           2;
            thicknessRatio    1.2;
            maxFirstLayerThickness 0.2;
            allowDiscontinuity 0;
        }
    }
}

renameBoundary
{
    defaultName fixedWalls;
    defaultType wall;

    newPatchNames
    {
        "wall"
        {
            type    wall;
            newName wall;
        }

        "inlet"
        {
            type     patch;
            newName  inlet;
        }

        "outlet"
        {
            type     patch;
            newName  outlet;
        }
    }
}


// ************************************************************************* //
